Revit 2027 API
CompoundStructure.GetLayers Method
 A copy of the layers which define this compound structure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<CompoundStructureLayer> GetLayers()
Public Function GetLayers As IList(Of CompoundStructureLayer)
public:
IList<CompoundStructureLayer^>^ GetLayers()
member GetLayers : unit -> IList<CompoundStructureLayer>
Return Value
IList<CompoundStructureLayer>
 The layers, returned in order (Exterior to Interior for walls, top to bottom for roofs, floors or ceilings). The index of each layer in this array can be used in other CompoundStructure methods accepting a layer index.
See Also
Reference
CompoundStructure Class
Autodesk.Revit.DB Namespace